decdream08/ADP_ST_MCU/SPC582Bxx_RLA AEK_AUD_D903V1 - Engine Sound Simulator with Connector Board/components/spc582bxx_platform_component_rla/lib/include/spc582b_registry.h
/*
 * I2S attributes
 */
#define SPC5_I2S_DSPI0_ENABLE_CLOCK()                                           \
  SPCSetPeripheralClockMode(SPC5_DSPI0_PCTL, SPC5_I2S_DSPI0_START_PCTL)
#define SPC5_I2S_DSPI0_DISABLE_CLOCK()                                          \
  SPCSetPeripheralClockMode(SPC5_DSPI0_PCTL, SPC5_I2S_DSPI0_STOP_PCTL)
#define SPC5_I2S_DSPI1_ENABLE_CLOCK()                                           \
  SPCSetPeripheralClockMode(SPC5_DSPI1_PCTL, SPC5_I2S_DSPI1_START_PCTL)
#define SPC5_I2S_DSPI1_DISABLE_CLOCK()                                          \
  SPCSetPeripheralClockMode(SPC5_DSPI1_PCTL, SPC5_I2S_DSPI1_STOP_PCTL)
#define SPC5_I2S_DSPI2_ENABLE_CLOCK()                                           \
  SPCSetPeripheralClockMode(SPC5_DSPI2_PCTL, SPC5_I2S_DSPI2_START_PCTL)
#define SPC5_I2S_DSPI2_DISABLE_CLOCK()                                          \
  SPCSetPeripheralClockMode(SPC5_DSPI2_PCTL, SPC5_I2S_DSPI2_STOP_PCTL)
#define SPC5_I2S_DSPI3_ENABLE_CLOCK()                                           \
  SPCSetPeripheralClockMode(SPC5_DSPI3_PCTL, SPC5_I2S_DSPI3_START_PCTL)
#define SPC5_I2S_DSPI3_DISABLE_CLOCK()                                          \
  SPCSetPeripheralClockMode(SPC5_DSPI3_PCTL, SPC5_I2S_DSPI3_STOP_PCTL)


/* LINFlex attributes.*/
#define SPC5_HAS_LINFLEX0                   TRUE
#define SPC5_LINFLEX0_BASE                  0xF7E8C000UL
#define SPC5_LINFLEX0L_BASE                 0xF7E8C000UL
#define SPC5_LINFLEX0H_BASE                 0xF7E8C08CUL
#define SPC5_LINFLEX0_PCTL                  92
#define SPC5_LINFLEX0_RXI_HANDLER           vector376
#define SPC5_LINFLEX0_TXI_HANDLER           vector377
#define SPC5_LINFLEX0_ERR_HANDLER           vector378
#define SPC5_LINFLEX0_RXI_NUMBER            376
#define SPC5_LINFLEX0_TXI_NUMBER            377
#define SPC5_LINFLEX0_ERR_NUMBER            378
#define SPC5_LINFLEX0_DMA_SUPPORTED         TRUE
#define SPC5_LINFLEX0_RX_DMA_MUX0_DEV_ID    15
#define SPC5_LINFLEX0_TX_DMA_MUX0_DEV_ID    16
#define SPC5_LINFLEX0_CLK                   SPC5_LIN_CLK

#define SPC5_HAS_LINFLEX1                   TRUE
#define SPC5_LINFLEX1_BASE                  0xFBE8C000UL
#define SPC5_LINFLEX1L_BASE                 0xFBE8C000UL
#define SPC5_LINFLEX1H_BASE                 0xFBE8C08CUL
#define SPC5_LINFLEX1_PCTL                  220
#define SPC5_LINFLEX1_RXI_HANDLER           vector380
#define SPC5_LINFLEX1_TXI_HANDLER           vector381
#define SPC5_LINFLEX1_ERR_HANDLER           vector382
#define SPC5_LINFLEX1_RXI_NUMBER            380
#define SPC5_LINFLEX1_TXI_NUMBER            381
#define SPC5_LINFLEX1_ERR_NUMBER            382
#define SPC5_LINFLEX1_DMA_SUPPORTED         TRUE
#define SPC5_LINFLEX1_RX_DMA_MUX0_DEV_ID    17
#define SPC5_LINFLEX1_TX_DMA_MUX0_DEV_ID    18
#define SPC5_LINFLEX1_CLK                   SPC5_LIN_CLK

#define SPC5_HAS_LINFLEX2                   TRUE
#define SPC5_LINFLEX2_BASE                  0xF7E90000UL
#define SPC5_LINFLEX2L_BASE                 0xF7E90000UL
#define SPC5_LINFLEX2H_BASE                 0xF7E9008CUL
#define SPC5_LINFLEX2_PCTL                  91
#define SPC5_LINFLEX2_RXI_HANDLER           vector384
#define SPC5_LINFLEX2_TXI_HANDLER           vector385
#define SPC5_LINFLEX2_ERR_HANDLER           vector386
#define SPC5_LINFLEX2_RXI_NUMBER            384
#define SPC5_LINFLEX2_TXI_NUMBER            385
#define SPC5_LINFLEX2_ERR_NUMBER            386
#define SPC5_LINFLEX2_DMA_SUPPORTED         TRUE
#define SPC5_LINFLEX2_RX_DMA_MUX0_DEV_ID    19
#define SPC5_LINFLEX2_TX_DMA_MUX0_DEV_ID    20
#define SPC5_LINFLEX2_CLK                   SPC5_LIN_CLK

#define SPC5_HAS_LINFLEX3                   FALSE
#define SPC5_HAS_LINFLEX4                   FALSE
#define SPC5_HAS_LINFLEX5                   FALSE
#define SPC5_HAS_LINFLEX6                   FALSE

#define SPC5_HAS_LINFLEX7                   TRUE
#define SPC5_LINFLEX7_BASE                  0xFBE98000UL
#define SPC5_LINFLEX7L_BASE                 0xFBE98000UL
#define SPC5_LINFLEX7H_BASE                 0xFBE9808CUL
#define SPC5_LINFLEX7_PCTL                  217
#define SPC5_LINFLEX7_RXI_HANDLER           vector404
#define SPC5_LINFLEX7_TXI_HANDLER           vector405
#define SPC5_LINFLEX7_ERR_HANDLER           vector406
#define SPC5_LINFLEX7_RXI_NUMBER            404
#define SPC5_LINFLEX7_TXI_NUMBER            405
#define SPC5_LINFLEX7_ERR_NUMBER            406
#define SPC5_LINFLEX7_DMA_SUPPORTED         TRUE
#define SPC5_LINFLEX7_RX_DMA_MUX0_DEV_ID    21
#define SPC5_LINFLEX7_TX_DMA_MUX0_DEV_ID    22
#define SPC5_LINFLEX7_CLK                   SPC5_LIN_CLK

#define SPC5_HAS_LINFLEX8                   FALSE
#define SPC5_HAS_LINFLEX9                   FALSE

#define SPC5_HAS_LINFLEX10                  TRUE
#define SPC5_LINFLEX10_BASE                 0xF7EA0000UL
#define SPC5_LINFLEX10L_BASE                0xF7EA0000UL
#define SPC5_LINFLEX10H_BASE                0xF7EA008CUL
#define SPC5_LINFLEX10_PCTL                 87
#define SPC5_LINFLEX10_RXI_HANDLER          vector416
#define SPC5_LINFLEX10_TXI_HANDLER          vector417
#define SPC5_LINFLEX10_ERR_HANDLER          vector418
#define SPC5_LINFLEX10_RXI_NUMBER           416
#define SPC5_LINFLEX10_TXI_NUMBER           417
#define SPC5_LINFLEX10_ERR_NUMBER           418
#define SPC5_LINFLEX10_DMA_SUPPORTED        TRUE
#define SPC5_LINFLEX10_RX_DMA_MUX0_DEV_ID   23
#define SPC5_LINFLEX10_TX_DMA_MUX0_DEV_ID   24
#define SPC5_LINFLEX10_CLK                  SPC5_LIN_CLK

#define SPC5_HAS_LINFLEX11                  FALSE
#define SPC5_HAS_LINFLEX12                  FALSE
#define SPC5_HAS_LINFLEX13                  FALSE
#define SPC5_HAS_LINFLEX14                  FALSE

#define SPC5_HAS_LINFLEX15                  TRUE
#define SPC5_LINFLEX15_BASE                 0xFBEA8000UL
#define SPC5_LINFLEX15L_BASE                0xFBEA8000UL
#define SPC5_LINFLEX15H_BASE                0xFBEA808CUL
#define SPC5_LINFLEX15_PCTL                 213
#define SPC5_LINFLEX15_RXI_HANDLER          vector436
#define SPC5_LINFLEX15_TXI_HANDLER          vector437
#define SPC5_LINFLEX15_ERR_HANDLER          vector438
#define SPC5_LINFLEX15_RXI_NUMBER           436
#define SPC5_LINFLEX15_TXI_NUMBER           437
#define SPC5_LINFLEX15_ERR_NUMBER           438
#define SPC5_LINFLEX15_DMA_SUPPORTED        TRUE
#define SPC5_LINFLEX15_RX_DMA_MUX0_DEV_ID   25
#define SPC5_LINFLEX15_TX_DMA_MUX0_DEV_ID   26
#define SPC5_LINFLEX15_CLK                  SPC5_LIN_CLK

#define SPC5_HAS_LINFLEX16                  FALSE
#define SPC5_HAS_LINFLEX17                  FALSE
#define SPC5_HAS_LINFLEX18                  FALSE
#define SPC5_HAS_LINFLEX19                  FALSE
#define SPC5_HAS_LINFLEX20                  FALSE
#define SPC5_HAS_LINFLEX21                  FALSE
#define SPC5_HAS_LINFLEX22                  FALSE
#define SPC5_HAS_LINFLEX23                  FALSE

