decdream08/ADP_ST_MCU/SPC582Bxx_RLA AEK_AUD_D903V1 - Engine Sound Simulator with Connector Board/components/spc582bxx_platform_component_rla/lib/include/spc582b_registry.h
/* SIUL2 attributes.*/
#define SPC5_HAS_SIUL2                      TRUE
#define SPC5_HAS_SIUL_PARALLEL_PORT_REG     TRUE
#define SPC5_SIUL2_PCTL                     15
#define SPC5_SIUL2_NUM_PORTS                10
#define SPC5_SIUL2_NUM_MUXES                420

/* PIT attributes. PITv2 driver support*/
#define SPC5_HAS_PIT0                       TRUE
#define SPC5_PIT0_BASE                      0xF7F84000UL
#define SPC5_PIT0_CHANNELS                  8
#define SPC5_PIT0_PCTL                      30
#define SPC5_PIT0_ENABLE_CLOCK()            SPCSetPeripheralClockMode(SPC5_PIT0_PCTL, SPC5_PIT0_START_PCTL);
#define SPC5_PIT0_DISABLE_CLOCK()           SPCSetPeripheralClockMode(SPC5_PIT0_PCTL, SPC5_PIT0_STOP_PCTL);
#define SPC5_HAS_PIT0_CH0                   TRUE
#define SPC5_HAS_PIT0_CH1                   TRUE
#define SPC5_HAS_PIT0_CH2                   TRUE
#define SPC5_HAS_PIT0_CH3                   TRUE
#define SPC5_HAS_PIT0_CH4                   TRUE
#define SPC5_HAS_PIT0_CH5                   TRUE
#define SPC5_HAS_PIT0_CH6                   TRUE
#define SPC5_HAS_PIT0_CH7                   TRUE
#define SPC5_PIT0_CH0_HANDLER               vector226
#define SPC5_PIT0_CH1_HANDLER               vector227
#define SPC5_PIT0_CH2_HANDLER               vector228
#define SPC5_PIT0_CH3_HANDLER               vector229
#define SPC5_PIT0_CH4_HANDLER               vector230
#define SPC5_PIT0_CH5_HANDLER               vector231
#define SPC5_PIT0_CH6_HANDLER               vector232
#define SPC5_PIT0_CH7_HANDLER               vector233
#define SPC5_PIT0_CH0_INT_NUMBER            226
#define SPC5_PIT0_CH1_INT_NUMBER            227
#define SPC5_PIT0_CH2_INT_NUMBER            228
#define SPC5_PIT0_CH3_INT_NUMBER            229
#define SPC5_PIT0_CH4_INT_NUMBER            230
#define SPC5_PIT0_CH5_INT_NUMBER            231
#define SPC5_PIT0_CH6_INT_NUMBER            232
#define SPC5_PIT0_CH7_INT_NUMBER            233

#define SPC5_HAS_PIT1                       FALSE


/* STM attributes.*/
#define SPC5_HAS_STM0                       FALSE
#define SPC5_HAS_STM1                       FALSE
#define SPC5_HAS_STM2                       TRUE

#define SPC5_STM2_BASE                      0xF4070000UL
#define SPC5_STM2_CHANNELS                  4
#define SPC5_HAS_STM2_CH0                   TRUE
#define SPC5_HAS_STM2_CH1                   TRUE
#define SPC5_HAS_STM2_CH2                   TRUE
#define SPC5_HAS_STM2_CH3                   TRUE
#define SPC5_STM0_CH1_CH3_SHARED_INT        FALSE
#define SPC5_STM2_CH0_HANDLER               vector44
#define SPC5_STM2_CH1_HANDLER               vector45
#define SPC5_STM2_CH2_HANDLER               vector46
#define SPC5_STM2_CH3_HANDLER               vector47
#define SPC5_STM2_CH0_INT_NUMBER            44
#define SPC5_STM2_CH1_INT_NUMBER            45
#define SPC5_STM2_CH2_INT_NUMBER            46
#define SPC5_STM2_CH3_INT_NUMBER            47

/* CAN SUBSYSTEM 0 attributes.*/
#define SPC5_HAS_CAN_SUB_0_M_CAN_0             TRUE
#define SPC5_CAN_SUB_0_M_CAN_0_PTCL            72
#define SPC5_CAN_SUB_0_M_CAN_0_ENABLE_CLOCK()  SPCSetPeripheralClockMode(SPC5_CAN_SUB_0_M_CAN_0_PTCL, SPC5_CAN_SUB_0_M_CAN_0_START_PTCL);
#define SPC5_CAN_SUB_0_M_CAN_0_DISABLE_CLOCK() SPCSetPeripheralClockMode(SPC5_CAN_SUB_0_M_CAN_0_PTCL, SPC5_CAN_SUB_0_M_CAN_0_STOP_PTCL);
#define SPC5_CAN_SUB_0_M_CAN_0_L0_HANDLER      vector686
#define SPC5_CAN_SUB_0_M_CAN_0_L1_HANDLER      vector687
#define SPC5_CAN_SUB_0_M_CAN_0_L0_NUMBER       686
#define SPC5_CAN_SUB_0_M_CAN_0_L1_NUMBER       687

#define SPC5_HAS_CAN_SUB_0_M_CAN_1             TRUE
#define SPC5_CAN_SUB_0_M_CAN_1_PTCL            69
#define SPC5_CAN_SUB_0_M_CAN_1_ENABLE_CLOCK()  SPCSetPeripheralClockMode(SPC5_CAN_SUB_0_M_CAN_1_PTCL, SPC5_CAN_SUB_0_M_CAN_1_START_PTCL);
#define SPC5_CAN_SUB_0_M_CAN_1_DISABLE_CLOCK() SPCSetPeripheralClockMode(SPC5_CAN_SUB_0_M_CAN_1_PTCL, SPC5_CAN_SUB_0_M_CAN_1_STOP_PTCL);
#define SPC5_CAN_SUB_0_M_CAN_1_L0_HANDLER      vector688
#define SPC5_CAN_SUB_0_M_CAN_1_L1_HANDLER      vector689
#define SPC5_CAN_SUB_0_M_CAN_1_L0_NUMBER       688
#define SPC5_CAN_SUB_0_M_CAN_1_L1_NUMBER       689

#define SPC5_HAS_CAN_SUB_0_M_CAN_2             TRUE
#define SPC5_CAN_SUB_0_M_CAN_2_PTCL            68
#define SPC5_CAN_SUB_0_M_CAN_2_ENABLE_CLOCK()  SPCSetPeripheralClockMode(SPC5_CAN_SUB_0_M_CAN_2_PTCL, SPC5_CAN_SUB_0_M_CAN_2_START_PTCL);
#define SPC5_CAN_SUB_0_M_CAN_2_DISABLE_CLOCK() SPCSetPeripheralClockMode(SPC5_CAN_SUB_0_M_CAN_2_PTCL, SPC5_CAN_SUB_0_M_CAN_2_STOP_PTCL);
#define SPC5_CAN_SUB_0_M_CAN_2_L0_HANDLER      vector690
#define SPC5_CAN_SUB_0_M_CAN_2_L1_HANDLER      vector691
#define SPC5_CAN_SUB_0_M_CAN_2_L0_NUMBER       690
#define SPC5_CAN_SUB_0_M_CAN_2_L1_NUMBER       691

#define SPC5_HAS_CAN_SUB_0_M_CAN_3             TRUE
#define SPC5_CAN_SUB_0_M_CAN_3_PTCL            67
#define SPC5_CAN_SUB_0_M_CAN_3_ENABLE_CLOCK()  SPCSetPeripheralClockMode(SPC5_CAN_SUB_0_M_CAN_3_PTCL, SPC5_CAN_SUB_0_M_CAN_3_START_PTCL);
#define SPC5_CAN_SUB_0_M_CAN_3_DISABLE_CLOCK() SPCSetPeripheralClockMode(SPC5_CAN_SUB_0_M_CAN_3_PTCL, SPC5_CAN_SUB_0_M_CAN_3_STOP_PTCL);
#define SPC5_CAN_SUB_0_M_CAN_3_L0_HANDLER      vector692
#define SPC5_CAN_SUB_0_M_CAN_3_L1_HANDLER      vector693
#define SPC5_CAN_SUB_0_M_CAN_3_L0_NUMBER       692
#define SPC5_CAN_SUB_0_M_CAN_3_L1_NUMBER       693

#define SPC5_HAS_CAN_SUB_0_M_CAN_4             FALSE

#define SPC5_HAS_CAN_SUB_0_RAM                 TRUE
#define SPC5_CAN_SUB_0_RAM_PTCL                74
#define SPC5_CAN_SUB_0_RAM_ENABLE_CLOCK()      SPCSetPeripheralClockMode(SPC5_CAN_SUB_0_RAM_PTCL, SPC5_CAN_SUB_0_RAM_START_PTCL);
#define SPC5_CAN_SUB_0_RAM_DISABLE_CLOCK()     SPCSetPeripheralClockMode(SPC5_CAN_SUB_0_RAM_PTCL, SPC5_CAN_SUB_0_RAM_STOP_PTCL);

/* CAN SUBSYSTEM 1 attributes.*/
#define SPC5_HAS_CAN_SUB_1_M_CAN_0             FALSE

#define SPC5_HAS_CAN_SUB_1_M_CAN_1             TRUE
#define SPC5_CAN_SUB_1_M_CAN_1_PTCL            198
#define SPC5_CAN_SUB_1_M_CAN_1_ENABLE_CLOCK()  SPCSetPeripheralClockMode(SPC5_CAN_SUB_1_M_CAN_1_PTCL, SPC5_CAN_SUB_1_M_CAN_1_START_PTCL);
#define SPC5_CAN_SUB_1_M_CAN_1_DISABLE_CLOCK() SPCSetPeripheralClockMode(SPC5_CAN_SUB_1_M_CAN_1_PTCL, SPC5_CAN_SUB_1_M_CAN_1_STOP_PTCL);
#define SPC5_CAN_SUB_1_M_CAN_1_L0_HANDLER      vector694
#define SPC5_CAN_SUB_1_M_CAN_1_L1_HANDLER      vector695
#define SPC5_CAN_SUB_1_M_CAN_1_L0_NUMBER       694
#define SPC5_CAN_SUB_1_M_CAN_1_L1_NUMBER       695

#define SPC5_HAS_CAN_SUB_1_M_CAN_2             TRUE
#define SPC5_CAN_SUB_1_M_CAN_2_PTCL            197
#define SPC5_CAN_SUB_1_M_CAN_2_ENABLE_CLOCK()  SPCSetPeripheralClockMode(SPC5_CAN_SUB_1_M_CAN_2_PTCL, SPC5_CAN_SUB_1_M_CAN_2_START_PTCL);
#define SPC5_CAN_SUB_1_M_CAN_2_DISABLE_CLOCK() SPCSetPeripheralClockMode(SPC5_CAN_SUB_1_M_CAN_2_PTCL, SPC5_CAN_SUB_1_M_CAN_2_STOP_PTCL);
#define SPC5_CAN_SUB_1_M_CAN_2_L0_HANDLER      vector696
#define SPC5_CAN_SUB_1_M_CAN_2_L1_HANDLER      vector697
#define SPC5_CAN_SUB_1_M_CAN_2_L0_NUMBER       696
#define SPC5_CAN_SUB_1_M_CAN_2_L1_NUMBER       697

