decdream08/ADP_ST_MCU/SPC582Bxx_RLA AEK_AUD_D903V1 - Engine Sound Simulator with Connector Board/components/spc582bxx_platform_component_rla/lib/include/spc582b_registry.h
#define SPC5_HAS_CAN_SUB_1_M_CAN_3             TRUE
#define SPC5_CAN_SUB_1_M_CAN_3_PTCL            196
#define SPC5_CAN_SUB_1_M_CAN_3_ENABLE_CLOCK()  SPCSetPeripheralClockMode(SPC5_CAN_SUB_1_M_CAN_3_PTCL, SPC5_CAN_SUB_1_M_CAN_3_START_PTCL);
#define SPC5_CAN_SUB_1_M_CAN_3_DISABLE_CLOCK() SPCSetPeripheralClockMode(SPC5_CAN_SUB_1_M_CAN_3_PTCL, SPC5_CAN_SUB_1_M_CAN_3_STOP_PTCL);
#define SPC5_CAN_SUB_1_M_CAN_3_L0_HANDLER      vector698
#define SPC5_CAN_SUB_1_M_CAN_3_L1_HANDLER      vector699
#define SPC5_CAN_SUB_1_M_CAN_3_L0_NUMBER       698
#define SPC5_CAN_SUB_1_M_CAN_3_L1_NUMBER       699

#define SPC5_HAS_CAN_SUB_1_M_CAN_4             FALSE

#define SPC5_HAS_CAN_SUB_1_RAM                 TRUE
#define SPC5_CAN_SUB_1_RAM_PTCL                202
#define SPC5_CAN_SUB_1_RAM_ENABLE_CLOCK()      SPCSetPeripheralClockMode(SPC5_CAN_SUB_1_RAM_PTCL, SPC5_CAN_SUB_1_RAM_START_PTCL);
#define SPC5_CAN_SUB_1_RAM_DISABLE_CLOCK()     SPCSetPeripheralClockMode(SPC5_CAN_SUB_1_RAM_PTCL, SPC5_CAN_SUB_1_RAM_STOP_PTCL);

/* CAN SUBSYSTEM 2 attributes.*/       
#define SPC5_HAS_CAN_SUB_2_M_CAN_0             FALSE
#define SPC5_HAS_CAN_SUB_2_M_CAN_1             FALSE
#define SPC5_HAS_CAN_SUB_2_M_CAN_2             FALSE
#define SPC5_HAS_CAN_SUB_2_M_CAN_3             FALSE
#define SPC5_HAS_CAN_SUB_2_M_CAN_4             FALSE
#define SPC5_HAS_CAN_SUB_2_RAM                 FALSE

/* CLOCK CALIBRATION CONTROL UNIT */
#define SPC5_HAS_CCCU_0                        TRUE
#define SPC5_CCCU_0_PTCL                       62
#define SPC5_CCCU_0_ENABLE_CLOCK()             SPCSetPeripheralClockMode(SPC5_CCCU_0_PTCL, SPC5_CCCU_0_START_PTCL);
#define SPC5_CCCU_0_DISABLE_CLOCK()            SPCSetPeripheralClockMode(SPC5_CCCU_0_PTCL, SPC5_CCCU_0_STOP_PTCL);

#define SPC5_HAS_CCCU_1                        FALSE

/* I2C attributes.*/
#define SPC5_HAS_I2C                        1
#define SPC5_I2C0_PCTL                       101
#define SPC5_I2C0_HANDLER                    vector448
#define	SPC5_I2C0_INT_NUMBER                 448

/* SWT attributes.*/
#define SPC5_HAS_SWT0                       FALSE
#define SPC5_HAS_SWT1                       FALSE
#define SPC5_HAS_SWT2                       TRUE
#define SPC5_SWT2_FCCU_CHANNEL              18U
#define SPC5_SWT2_BASE                      0xF4058000UL
#define SPC5_SWT2_HANDLER                   vector34
#define SPC5_SWT2_INT_NUMBER                34
#define SPC5_HAS_SWT3                       FALSE

/* SARADC attributes.*/
#define SPC5_HAS_SARADC12_0                 FALSE
#define SPC5_HAS_SARADC12_1                 FALSE
#define SPC5_HAS_SARADC12_2                 FALSE
#define SPC5_HAS_SARADC12_3                 FALSE
#define SPC5_HAS_SARADC12_4                 FALSE
#define SPC5_HAS_SARADC12_5                 FALSE
#define SPC5_HAS_SARADC12_6                 FALSE

#define SPC5_HAS_SARADC12_SV                TRUE
#define SPC5_SARADC12_SV_PCTL               112
#define SPC5_SARADC12_SV_HANDLER            vector543
#define SPC5_SARADC12_SV_INT_NUMBER         543
#define SPC5_SARADC12_SV_DMA_MUX0_DEV_ID    1

#define SPC5_HAS_SARADC12_SV_1              FALSE
#define SPC5_HAS_SARADC10_0                 FALSE
#define SPC5_HAS_SARADC10_1                 FALSE
#define SPC5_HAS_SARADC10_STANDBY           FALSE

#define SPC5_SARADC_MASK_REG_NUM            3U
/** @} */

/* FCCU attributes.*/
#define SPC5_HAS_FCCU                       TRUE
#define SPC5_FCCU_BASE                      0xFBF58000UL
#define SPC5_FCCU_CH_NUMBER                 128U
#define SPC5_FCCU_ALARM_HANDLER             vector488
#define SPC5_FCCU_CONFIG_HANDLER            vector489
#define SPC5_FCCU_ALARM_INT_NUMBER          488
#define SPC5_FCCU_CONFIG_INT_NUMBER         489
#define SPC5_FCCU_HAS_ERR_INPUT_PIN         TRUE
#define SPC5_FCCU_EIN_ERR_CH                96U
#define SPC5_FCCU_EIN_MSCR_IO               27U
#define SPC5_FCCU_RF_E_REG_RESET_VAL        {0x00040040UL, 0x00000000UL, 0x00000000UL, 0x00000000UL}
#define SPC5_FCCU_MAX_DELTA_T_US            10000UL

#define MC_RGM_FCCU_RST                     MC_RGM.PRST5.B.FCCU_RST

/* eMIOS attributes.*/
#define SPC5_HAS_EMIOS0                     TRUE
#define SPC5_EMIOS0_BASE                    0xF7C38000UL
#define SPC5_EMIOS0_PCTL                    241
#define SPC5_EMIOS0_GFR_F0F1_HANDLER        vector900
#define SPC5_EMIOS0_GFR_F2F3_HANDLER        vector901
#define SPC5_EMIOS0_GFR_F4F5_HANDLER        vector902
#define SPC5_EMIOS0_GFR_F6F7_HANDLER        vector903
#define SPC5_EMIOS0_GFR_F8F9_HANDLER        vector904
#define SPC5_EMIOS0_GFR_F10F11_HANDLER      vector905
#define SPC5_EMIOS0_GFR_F12F13_HANDLER      vector906
#define SPC5_EMIOS0_GFR_F14F15_HANDLER      vector907
#define SPC5_EMIOS0_GFR_F16F17_HANDLER      vector908
#define SPC5_EMIOS0_GFR_F18F19_HANDLER      vector909
#define SPC5_EMIOS0_GFR_F20F21_HANDLER      vector910
#define SPC5_EMIOS0_GFR_F22F23_HANDLER      vector911
#define SPC5_EMIOS0_GFR_F24F25_HANDLER      vector912
#define SPC5_EMIOS0_GFR_F26F27_HANDLER      vector913
#define SPC5_EMIOS0_GFR_F28F29_HANDLER      vector914
#define SPC5_EMIOS0_GFR_F30F31_HANDLER      vector915
#define SPC5_EMIOS0_GFR_F0F1_NUMBER         900
#define SPC5_EMIOS0_GFR_F2F3_NUMBER         901
#define SPC5_EMIOS0_GFR_F4F5_NUMBER         902
#define SPC5_EMIOS0_GFR_F6F7_NUMBER         903
#define SPC5_EMIOS0_GFR_F8F9_NUMBER         904
#define SPC5_EMIOS0_GFR_F10F11_NUMBER       905
#define SPC5_EMIOS0_GFR_F12F13_NUMBER       906
#define SPC5_EMIOS0_GFR_F14F15_NUMBER       907
#define SPC5_EMIOS0_GFR_F16F17_NUMBER       908
#define SPC5_EMIOS0_GFR_F18F19_NUMBER       909
#define SPC5_EMIOS0_GFR_F20F21_NUMBER       910
#define SPC5_EMIOS0_GFR_F22F23_NUMBER       911
#define SPC5_EMIOS0_GFR_F24F25_NUMBER       912
#define SPC5_EMIOS0_GFR_F26F27_NUMBER       913
#define SPC5_EMIOS0_GFR_F28F29_NUMBER       914
#define SPC5_EMIOS0_GFR_F30F31_NUMBER       915

#define SPC5_HAS_EMIOS1                     FALSE
#define SPC5_HAS_EMIOS2                     FALSE

/* WKPU Attributes */
#define SPC5_HAS_WKPU0                      TRUE
#define SPC5_WKPU0_BASE                     0xF7F98000UL
#define SPC5_WKPU0_IRQ0_HANDLER             vector247
#define SPC5_WKPU0_IRQ1_HANDLER             vector248
#define SPC5_WKPU0_IRQ2_HANDLER             vector249
#define SPC5_WKPU0_IRQ3_HANDLER             vector250
#define SPC5_WKPU0_IRQ0_INT_NUMBER          247
#define SPC5_WKPU0_IRQ1_INT_NUMBER          248
#define SPC5_WKPU0_IRQ2_INT_NUMBER          249
#define SPC5_WKPU0_IRQ3_INT_NUMBER          250

#define SPC5_HAS_WKPU1                      FALSE

#define SPC5_WKPU_SUPPORT_EXT_SRC           TRUE

/* BCTU Attributes */
#define SPC5_BCTU_BASE                      0xF7C30000UL
#define SPC5_BCTU_PCTL                      243
#define SPC5_BCTU_TRIGGER_NUMBER            32U

/* RTC attributes.*/
#define SCP5_RTC_RTC_HANDLER                vector224
#define SCP5_RTC_API_HANDLER                vector225
#define SCP5_RTC_RTC_INT_NUMBER             224
#define SCP5_RTC_API_INT_NUMBER             225

/** @} */

#endif /* SPC5_REGISTRY_H */

/** @} */
